Revit 2024 API
BuiltInFailures.StairRampFailures.StairsCommonRunGenerateLayoutFailure Property
 Fail to get base line thus fail to generate run layout
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsCommonRunGenerateLayoutFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsCommonRunGenerateLayoutFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsCommonRunGenerateLayoutFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace